[
  {
    "company": "Trellix",
    "role": "Software Development Engineer (Full-time)",
    "duration": "Jul 2025 - Present",
    "location": "Bengaluru, Karnataka, India",
    "description": "Preventing unauthorized exfiltration of sensitive corporate data as part of the Data Loss Prevention (Windows) team.",
    "highlights": []
  },
  {
    "company": "Intel Corporation",
    "role": "Software Development Engineer (Full-time)",
    "duration": "Jun 2024 - Jul 2025",
    "location": "Bengaluru, Karnataka, India",
    "description": "Team - Confidential Computing (Intel SGX/TDX), Platform Engineering Group",
    "highlights": [
      "Contributed to Intel SGX Gramine to secure confidential computing workloads (PyTorch, OpenVINO, MySQL, Redis), addressing memory faults and expanding distro support (Ubuntu 24.04, CentOS Stream 9, RHEL 9, and SUSE).",
      "Implemented Intel SGX fuzzing framework by CPU ID fuzzing harnesses with LLVM's clang libFuzzer and Address/Memory Sanitizers and building test automation with LLVM coverage tools (llvm-profdata, llvm-cov), resulting in 8+ vulnerability discoveries in Intel SGX TCB with 97% branch coverage with patches merged upstream.",
      "Engineered Intel TDX full-disk encryption (FDE) solution supporting multi-VM launch scenarios, implementing secure key retrieval through Hashicorp Vault and ITA Key Broker Service, optimizing .qcow2 encrypted image sizes by 30% and resolving 20+ critical validation bugs in Rust.",
      "Led creation of CentOS Virtualization SIG attestation guides for Intel TDX implementation, updating RHEL packages and fixing 10+ validation bugs that accelerated secure TD deployments across 4th Gen Intel Xeon.",
      "Integrated Post-Quantum Cryptography (PQC) with Intel SGX via Crypto API Toolkit (CTK), implementing 8+ NIST-approved algorithms for key encapsulation and digital signatures while maintaining PKCS11 compliance, creating a flexible alternative to hardware HSMs.",
      "Enhanced LLM Adversarial Robustness Toolkit for evaluating LLM robustness by integrating uv package manager, implementing automatic batch size detection, customizable filtering policies, storage of best attack tokens, and building an automated test runner that achieved 40% reduced build times.",
      "Conducted comprehensive vLLM benchmarking comparing legacy VMs vs Intel TDX Trusted Domains with Deepseek-7B/Llama-2-70B models, quantifying ITL latency and TPS throughput across 20K+ test runs on Intel 5th Gen Xeon (Emerald Rapids) processors."
    ]
  },
  {
    "company": "Intel Corporation",
    "role": "Graduate Technical Intern",
    "duration": "Jun 2023 - Dec 2023",
    "location": "Bengaluru, Karnataka, India",
    "description": "Team - FIDO Device Onboarding, Intel Product Assurance & Security",
    "highlights": [
      "Collaborated with FIDO Device Onboarding (FDO) team to help implement robust security measures for Zero-Touch Provisioning (ZTP) of Intel Edge Devices including Intel NUCs, IoT Gateways, and Edge Servers.",
      "Modernized cryptographic security architecture by implementing OpenSSL 3.0 migration for Service Info (SVI) modules, reduced Client SDK codebase by 15%, and used RESTler fuzzing toolkit for security validation, identifying and mitigating 15+ bugs.",
      "Designed and implemented a POC of Bare Metal Onboarding (BMO) with real-time status monitoring in React using Intel design guidelines, and a scalable backend with CBOR/JSON REST APIs and an H2 database, and incorporated robust regex device serial number validation that improved data integrity by 25%."
    ]
  }
]